Пансион83/src/Enums/RoomStatusesIcons/RoomStatusesIcons.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RoomStatusesIcons</name>
  <enumValues>
    <name>Vacant</name>
  </enumValues>
  <enumValues>
    <name>Reserved</name>
  </enumValues>
  <enumValues>
    <name>Occupied</name>
  </enumValues>
  <enumValues>
    <name>CheckOut</name>
  </enumValues>
  <enumValues>
    <name>TidyingUp</name>
  </enumValues>
  <enumValues>
    <name>Waiting</name>
  </enumValues>
  <enumValues>
    <name>None</name>
  </enumValues>
</mdclass:Enum>

Пансион83/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>BlackListPersons</name>
      <description>EN='&quot;Black&quot; list persons'; RU='В &quot;черном&quot; списке'</description>
    </items>
    <items>
      <name>CheckedInGuests</name>
      <description>EN='Checked-in guests'; RU='Проживающие гости'</description>
    </items>
    <items>
      <name>CheckedOutGuests</name>
      <description>EN='Checked-out guests'; RU='Выехавшие гости'</description>
    </items>
    <items>
      <name>ExternalClients</name>
      <description>EN='External clients'; RU='Сторонние посетители'</description>
    </items>
    <items>
      <name>ReservedGuests</name>
      <description>EN='Reserved guests'; RU='Гости в брони'</description>
    </items>
  </predefined>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>170</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Address</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentType</name>
    <type>
      <types>CatalogRef.УдостоверениеЛичности</types>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentSeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentIssueDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentUnitCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentIssuedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountType</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Salutation</name>
    <type>
      <types>CatalogRef.Обращения</types>
    </type>
  </attributes>
  <attributes>
    <name>БелыйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерныйЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CopyRemarksToDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Photo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Signature</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientType</name>
    <type>
      <types>CatalogRef.ТипыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientTypeConfirmationText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MarketingCode</name>
    <type>
      <types>CatalogRef.КодМаркетинга</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceOfBusiness</name>
    <type>
      <types>CatalogRef.ИсточИнфоГостиница</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>CreateDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FolioCustomerPresentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RoomRate</name>
    <type>
      <types>CatalogRef.Тарифы</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRateServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Region</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>City</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Age</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AddressPresentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentPresentation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Position</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ChargingRules</name>
    <attributes>
      <name>ChargingRule</name>
      <type>
        <types>EnumRef.ChargingRuleTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ChargingRuleValue</name>
      <type>
        <types>CatalogRef.Услуги</types>
        <types>CatalogRef.НаборыУслуг</types>
        <types>CatalogRef.ТипыНомеров</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ChargingFolio</name>
      <type>
        <types>DocumentRef.СчетПроживания</types>
      </type>
    </attributes>
    <attributes>
      <name>ValidFromDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ValidToDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IsPersonal</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Пансион83/src/CommonModules/УпрСерверныеФункции/Module.bsl
//-----------------------------------------------------------------------------
&AtServer
Функция cmGetDocumentItemRefByDocNumber(pDocName, pDocNumber, pEmptyRef=False) Экспорт	
	Если pEmptyRef = Неопределено Тогда
		pEmptyRef = False;
	КонецЕсли;
	Если pEmptyRef Тогда
		Возврат Documents[pDocName].EmptyRef();
	Else
		vDocRef = Documents[pDocName].FindByNumber(pDocNumber);
		Возврат vDocRef;
	КонецЕсли;
КонецФункции //cmGetDocumentItemRefByDocNumber

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetCatalogItemRefByCode(pCatalogName, pCode = "", pEmptyRef=False, pAttribute="")	Экспорт	
	Если pEmptyRef = Неопределено Тогда
		pEmptyRef = False;
	КонецЕсли;
	Если pAttribute = Неопределено Тогда
		pAttribute = "";
	КонецЕсли;
	Если pEmptyRef Тогда
		Возврат Справочники[pCatalogName].EmptyRef();
	Else
		Если ЗначениеЗаполнено(pAttribute) Тогда
			vCatalogRef = Справочники[pCatalogName].FindByCode(pCode)[pAttribute];
		Else
			vCatalogRef = Справочники[pCatalogName].FindByCode(pCode);
		КонецЕсли;
		Возврат vCatalogRef;
	КонецЕсли;
КонецФункции //cmGetCatalogItemRefByCode

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetCatalogItemRefByName(pCatalogName, pName = "", pEmptyRef=False, pAttribute="")	Экспорт	
	Если pEmptyRef = Неопределено Тогда
		pEmptyRef = False;
	КонецЕсли;
	Если pAttribute = Неопределено Тогда
		pAttribute = "";
	КонецЕсли;
	Если pEmptyRef Тогда
		Возврат Справочники[pCatalogName].EmptyRef();
	Else
		Если ЗначениеЗаполнено(pAttribute) Тогда
			vCatalogRef = Справочники[pCatalogName][pName][pAttribute];
		Else
			vCatalogRef = Справочники[pCatalogName][pName];
		КонецЕсли;
		Возврат vCatalogRef;
	КонецЕсли;
КонецФункции //cmGetCatalogItemRefByName

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetCatalogItemRefByDescription(pCatalogName, pDescription = "", pEmptyRef=False, pAttribute="") Экспорт	
	Если pEmptyRef = Неопределено Тогда
		pEmptyRef = False;
	КонецЕсли;
	Если pAttribute = Неопределено Тогда
		pAttribute = "";
	КонецЕсли;
	Если pEmptyRef Тогда
		Возврат Справочники[pCatalogName].EmptyRef();
	Else
		Если ЗначениеЗаполнено(pAttribute) Тогда
			vCatalogRef = Справочники[pCatalogName].FindByDescription(pDescription, True)[pAttribute];
		Else
			vCatalogRef = Справочники[pCatalogName].FindByDescription(pDescription, True);
		КонецЕсли;
		Возврат vCatalogRef;
	КонецЕсли;
КонецФункции //cmGetCatalogItemRefByDescription

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetEnumItem(pEnumName, pEnumItem) Экспорт
	vEnum = Перечисления[pEnumName][pEnumItem];
	Возврат vEnum;
КонецФункции //cmGetEnumItem

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetAttributeByRef(pRef, pAttribute = "") Экспорт
	Если pAttribute = Неопределено Тогда
		pAttribute = "";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(pAttribute) Тогда
		vVal = pRef.Description;
	Else
		vFindedDot = Find(pAttribute, ".");
		Если vFindedDot > 0 Тогда
			vFirstAttribute = Left(pAttribute, vFindedDot-1);
			vSecondAttribute = Right(pAttribute, StrLen(pAttribute)-vFindedDot);
			vVal = pRef[vFirstAttribute];
			vVal = vVal[vSecondAttribute];
		Else
			vVal = pRef[pAttribute];
		КонецЕсли;
	КонецЕсли;
	Возврат vVal;
КонецФункции //cmGetAttributeByRef

//-----------------------------------------------------------------------------
&AtServer
Процедура cmChangeObjectAttributeByRef(pRef, pAttribute = "", pValue = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(pRef) Or Не ЗначениеЗаполнено(pAttribute) Тогда
		Возврат;
	КонецЕсли;
	Try
		vObj = pRef.GetObject();
		vObj[pAttribute] = pValue;
		vObj.Write();
	Except
		Возврат;
	EndTry;
КонецПроцедуры //cmChangeObjectAttributeByRef

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetMetadataMethodOrAttribiteByRef(pRef, pMethod = "", pAttribute = "") Экспорт
	//Check paramters
	Если pAttribute = Неопределено Тогда
		pAttribute = "";
	КонецЕсли;
	Если pMethod = Неопределено Тогда
		pMethod = "";
	КонецЕсли;
	Если Не IsBlankString(pMethod) Тогда
		Если pMethod = "Presentation" Тогда
			vVal = pRef.Metadata().Presentation();
		ИначеЕсли pMethod = "FullName" Тогда
			vVal = pRef.Metadata().FullName();
		ИначеЕсли pMethod = "Parent" Тогда
			vVal = pRef.Metadata().Parent();
		Else
			vVal = pRef.Description;
		КонецЕсли;
	Else
		Если Не IsBlankString(pAttribute) Тогда
			vVal = pRef.Metadata[pAttribute];
		Else
			vVal = pRef.Description;
		КонецЕсли;
	КонецЕсли;
	Возврат vVal;
КонецФункции //cmGetMetadataMethodOrAttribiteByRef

//-----------------------------------------------------------------------------
// Description: Returns icon of the given ГруппаНомеров status
// Parameters: ГруппаНомеров status 
// Возврат value: Picture object
//-----------------------------------------------------------------------------
&AtServer
Функция cmGetRoomStatusIconOnServer(pRoomStatus) Экспорт
	vPicture = PictureLib.Empty;
	Если ЗначениеЗаполнено(pRoomStatus) Тогда
		Если ЗначениеЗаполнено(pRoomStatus.RoomStatusIcon) Тогда
			Если pRoomStatus.RoomStatusIcon = Перечисления.RoomStatusesIcons.Occupied Тогда
				vPicture = PictureLib.Occupied;
			ИначеЕсли pRoomStatus.RoomStatusIcon = Перечисления.RoomStatusesIcons.Reserved Тогда
				vPicture = PictureLib.Reserved;
			ИначеЕсли pRoomStatus.RoomStatusIcon = Перечисления.RoomStatusesIcons.Waiting Тогда
				vPicture = PictureLib.Waiting;
			ИначеЕсли pRoomStatus.RoomStatusIcon = Перечисления.RoomStatusesIcons.TidyingUp Тогда
				vPicture = PictureLib.TidyingUp;
			ИначеЕсли pRoomStatus.RoomStatusIcon = Перечисления.RoomStatusesIcons.ВыездФакт Тогда
				vPicture = PictureLib.ВыездФакт;
			ИначеЕсли pRoomStatus.RoomStatusIcon = Перечисления.RoomStatusesIcons.Vacant Тогда
				vPicture = PictureLib.Vacant;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат vPicture;
КонецФункции //cmGetRoomStatusIconOnServer

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetCurrentHotelAttribute(pAttr = "") Экспорт
	//Check parameters
	Если pAttr = Неопределено Тогда
		pAttr = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(pAttr) Тогда
		Возврат ПараметрыСеанса.ТекущаяГостиница[pAttr];
	Else
		Возврат ПараметрыСеанса.ТекущаяГостиница;
	КонецЕсли;
КонецФункции //cmGetCurrentHotelAttribute

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetCurrentUserAttribute(pAttr = "") Экспорт
	Если pAttr = Неопределено Тогда
		pAttr = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(pAttr) Тогда
		Возврат ПараметрыСеанса.ТекПользователь[pAttr];
	Else
		Возврат ПараметрыСеанса.ТекПользователь;
	КонецЕсли;
КонецФункции //cmGetCurrentUserAttribute

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetGuestsChoiceDataList(pText) Экспорт
	vChoiceDataList = Новый СписокЗначений;
	vQry = Новый Query;
	vQry.Text =
	"SELECT
	|	Клиенты.Ref,
	|	Клиенты.Description,
	|	Клиенты.FullName,
	|	Клиенты.Code,
	|	Клиенты.ДатаРождения,
	|	Клиенты.IdentityDocumentSeries AS IDSeries,
	|	Клиенты.IdentityDocumentNumber AS IDNumber
	|FROM
	|	Catalog.Клиенты AS Клиенты
	|WHERE
	|	NOT Клиенты.IsFolder
	|	AND NOT Клиенты.DeletionMark
	|	AND Клиенты.FullName LIKE &qText";
	vQry.SetParameter("qText", "%"+pText+"%");
	vQryResult = vQry.Execute().Choose();
	Пока vQryResult.Next() Цикл
		vChoiceDataList.Add(vQryResult.Ref, vQryResult.FullName+?(ЗначениеЗаполнено(vQryResult.ДатаРождения), " "+Format(vQryResult.ДатаРождения, "DLF=D")+" ", " ")+?(ЗначениеЗаполнено(vQryResult.IDSeries), СокрЛП(vQryResult.IDSeries)+" ", " ")+?(ЗначениеЗаполнено(vQryResult.IDNumber), СокрЛП(vQryResult.IDNumber)+" ", " ")+"("+?(Число(vQryResult.Code), Format(Number(vQryResult.Code), "ND=12; NFD=0; NG="), СокрЛП(vQryResult.Code))+")");
	EndDo;
	//Возврат
	Возврат PutToTempStorage(vChoiceDataList);
КонецФункции //cmGetGuestsChoiceDataList

//-----------------------------------------------------------------------------
&AtServer
Функция cmChangeCurrentHotel(pHotel) Экспорт
	Если ЗначениеЗаполнено(pHotel) Тогда
		ПараметрыСеанса.ТекущаяГостиница = pHotel;
		Возврат pHotel.GetObject().pmGetHotelPrintName(ПараметрыСеанса.ТекЛокализация);
	Else
		Возврат "";
	КонецЕсли;
КонецФункции //cmChangeCurrentHotel

//-----------------------------------------------------------------------------
// Description: Returns text according to the current or parameter language.  
//              In comparison to the NStr() function it is simply returns input string if 
//              string format is wrong or language is undefined. NStr() in this case returns empty string
// Parameters: Text string in different languages, Language
// Возврат value: Text in given language
//-----------------------------------------------------------------------------
&AtServer
Функция cmNStrAtServer(pStr, pLang = Неопределено) Экспорт
	vStr = TrimR(pStr);
	vStr = StrReplace(vStr, "RU = '", "ru='");
	vStr = StrReplace(vStr, "RU='", "ru='");
	vStr = StrReplace(vStr, "EN = '", "en='");
	vStr = StrReplace(vStr, "EN='", "en='");
	vStr = StrReplace(vStr, "DE = '", "de='");
	vStr = StrReplace(vStr, "DE='", "de='");
	vNStr = "";
	Если pLang = Неопределено Тогда
		vNStr = NStr(vStr);
	Else
		vNStr = NStr(vStr, Lower(СокрЛП(pLang.Code)));
	КонецЕсли;
	Если IsBlankString(vNStr) Тогда
		vDePos = Find(vStr, "de='");
		Если vDePos = 0 Тогда
			vEnPos = Find(vStr, "en='");
			Если vEnPos > 0 Тогда
				vEnText = Mid(vStr, vEnPos + 4);
				vApPos = Find(vEnText, "'");
				Если vApPos > 0 Тогда
					vEnText = Left(vEnText, vApPos - 1);
					Если Не IsBlankString(vEnText) Тогда
						vFixedStr = vStr + ";de='" + vEnText + "'";
						Если pLang = Неопределено Тогда
							vNStr = NStr(vFixedStr);
						Else
							vNStr = NStr(vFixedStr, СокрЛП(pLang.Code));
						КонецЕсли;
						Если Не IsBlankString(vNStr) Тогда
							Возврат vNStr;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Возврат vStr;
	Else
		Возврат vNStr;
	КонецЕсли;
КонецФункции //cmNStrAtServer

//-----------------------------------------------------------------------------
&AtServer
Процедура cmWriteLogEventAtServer(pEventName, pEventLogLevel = Неопределено, pMetadata = Неопределено, pData = Неопределено, pRemarks = "") Экспорт
	vMetadata = Неопределено;
	Если pMetadata <> Неопределено Тогда
		Execute("vMetadata = Metadata."+pMetadata);
	КонецЕсли;
	vData = Неопределено;
	Если pData <> Неопределено Тогда
		Execute("vData = "+pData);
	КонецЕсли;
	WriteLogEvent(pEventName, ?(pEventLogLevel=Неопределено, EventLogLevel.Information, pEventLogLevel), vMetadata, vData, pRemarks);
КонецПроцедуры //cmWriteLogEventAtServer

//-----------------------------------------------------------------------------
&AtServer
Функция cmCheckUserPermissionsAtServer(pPermission) Экспорт
	Возврат cmCheckUserPermissions(pPermission);
КонецФункции //cmCheckUserPermissionsAtServer

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetEmployeePermissionGroupAtServer(pEmployee) Экспорт
	Возврат cmGetEmployeePermissionGroup(pEmployee);
КонецФункции //cmGetEmployeePermissionGroupAtServer

//-----------------------------------------------------------------------------
&AtServer
Функция cmGetServerCurrentDate() Экспорт
	Возврат CurrentDate();
КонецФункции //cmGetServerCurrentDate
